app/Http/ViewComposers/SettingComposer.php

select * from `settings` where `name` = 'app_name'
---
    public function compose(View $view)
    {
        $setting = Setting::get();
        $view->with([
            'app_name' => $setting->where('name', 'app_name')->first()->value,
            'app_description' => $setting->where('name', 'app_description')->first()->value,